function [Fe1, Fe2] = function_of_Fe(JXYe,JBPe)
%%%%%%% 初始化Fe1和Fe2
Fe1 = zeros(9, 1);
Fe2 = zeros(9, 1);
%%%%%%% 初始化Fe1和Fe2

%%%%%%% 高斯积分点和权重
gp = [0.9324695142031521, 0.6612093864662645, 0.2386191860831969, -0.9324695142031521, -0.6612093864662645, -0.2386191860831969];
gw = [0.1713244923791704, 0.3607615730481386, 0.4679139345726910, 0.1713244923791704, 0.3607615730481386, 0.4679139345726910];
kesi = gp;
ita = gp;
%%%%%%% 高斯积分点和权重

%%%%%%% (压强)自然边界条件数据
P_side = JBPe(1, 2);    % 边界单元的边界编号
l = JBPe(1, 3);         % 边界边外法向与x轴余弦
m = JBPe(1, 4);         % 边界边外法向与y轴余弦
p_value1 = JBPe(1, 5);  % 边界边第一点处压力值
P_value2 = JBPe(1, 6);  % 边界边第二点处压力值
%%%%%%% (压强)自然边界条件数据

%%%%%%% Fe1, Fe2的数值积分
%%%%%%% 当压力施加于单元第1边时，Fe1和Fe2的计算
if P_side == 1
    for i = 1:6
        fy = [1/4 * kesi(i) * (-1) * (kesi(i) - 1) * ((-1) - 1);
            1/2 * (-1) * (1 - kesi(i)^2) * ((-1) - 1);
            1/4 * kesi(i) * (-1) * (kesi(i) + 1) * ((-1) - 1);
            1/2 * kesi(i) * ( kesi(i) - 1) * (1 - (-1)^2);
            (1 - kesi(i)^2) * (1 - (-1)^2);
            1/2 * kesi(i) * (kesi(i) + 1) * (1 - (-1)^2);
            1/4 * kesi(i) * (-1) * (kesi(i) - 1) * ((-1) + 1);
            1/2 * (-1) * (1 - kesi(i)^2) * ((-1) + 1);
            1/4 * kesi(i) * (-1) * (kesi(i) + 1) * ((-1) + 1);];
        Fyp = [1/4 * (1 - kesi(i)) * (1 - (-1))
            1/4 * (1 + kesi(i)) * (1 - (-1))
            1/4 * (1 + kesi(i)) * (1 + (-1))
            1/4 * (1 - kesi(i)) * (1 + (-1))];
        P = [p_value1, P_value2, 0, 0]';
        le = sqrt((JXYe(1 ,1) - JXYe(3 ,1))^2 + (JXYe(1 ,2) - JXYe(3 ,2))^2);
        Fe1 = Fe1 + gw(i) * Fyp' * P * l * fy *le/2;
        Fe2 = Fe2 + gw(i) * Fyp' * P * m * fy *le/2;
    end
end
%%%%%%% 当压力施加于单元第1边时，Fe1和Fe2的计算

%%%%%%% 当压力施加于单元第2边时，Fe1和Fe2的计算
if P_side == 2
    for j = 1:6
        fy = [1/4 * 1 * ita(j) * (1 - 1) * (ita(j) - 1);
            1/2 * ita(j) * (1 - 1^2) * (ita(j) - 1);
            1/4 * 1 * ita(j) * (1 + 1) * (ita(j) - 1);
            1/2 * 1 * (1 - 1) * (1 - ita(j)^2);
            (1 - 1^2) * (1 - ita(j)^2);
            1/2 * 1 * (1 + 1) * (1 - ita(j)^2);
            1/4 * 1 * ita(j) * (1 - 1) * (ita(j) + 1);
            1/2 * ita(j) * (1 - 1^2) * (ita(j) + 1);
            1/4 * 1 * ita(j) * (1 + 1) * (ita(j) + 1);];
        Fyp = [1/4 * (1 - 1) * (1 - ita(j))
            1/4 * (1 + 1) * (1 - ita(j))
            1/4 * (1 + 1) * (1 + ita(j))
            1/4 * (1 - 1) * (1 + ita(j))];
        P = [0, p_value1, P_value2, 0]';
        le = sqrt((JXYe(3 ,1) - JXYe(9 ,1))^2 + (JXYe(3 ,2) - JXYe(9 ,2))^2);
        Fe1 = Fe1 + gw(j) * Fyp' * P * l * fy *le/2;
        Fe2 = Fe2 + gw(j) * Fyp' * P * m * fy *le/2;
    end
end
%%%%%%% 当压力施加于单元第2边时，Fe1和Fe2的计算

%%%%%%% 当压力施加于单元第3边时，Fe1和Fe2的计算
if P_side == 3
    for i = 1:6
        fy = [1/4 * kesi(i) * 1 * (kesi(i) - 1) * (1 - 1);
            1/2 * 1 * (1 - kesi(i)^2) * (1 - 1);
            1/4 * kesi(i) * 1 * (kesi(i) + 1) * (1 - 1);
            1/2 * kesi(i) * ( kesi(i) - 1) * (1 - 1^2);
            (1 - kesi(i)^2) * (1 - 1^2);
            1/2 * kesi(i) * (kesi(i) + 1) * (1 - 1^2);
            1/4 * kesi(i) * 1 * (kesi(i) - 1) * (1 + 1);
            1/2 * 1 * (1 - kesi(i)^2) * (1 + 1);
            1/4 * kesi(i) * 1 * (kesi(i) + 1) * (1 + 1);];
        Fyp = [1/4 * (1 - kesi(i)) * (1 - 1)
            1/4 * (1 + kesi(i)) * (1 - 1)
            1/4 * (1 + kesi(i)) * (1 + 1)
            1/4 * (1 - kesi(i)) * (1 + 1)];
        P = [0, 0, p_value1, P_value2]';
        le = sqrt((JXYe(7 ,1) - JXYe(9 ,1))^2 + (JXYe(7 ,2) - JXYe(9 ,2))^2);
        Fe1 = Fe1 + gw(i) * Fyp' * P * l * fy *le/2;
        Fe2 = Fe2 + gw(i) * Fyp' * P * m * fy *le/2;
    end
end
%%%%%%% 当压力施加于单元第3边时，Fe1和Fe2的计算

%%%%%%% 当压力施加于单元第4边时，Fe1和Fe2的计算
if P_side == 4
    for j = 1:6
        fy = [1/4 * (-1) * ita(j) * ((-1) - 1) * (ita(j) - 1);
            1/2 * ita(j) * (1 - (-1)^2) * (ita(j) - 1);
            1/4 * (-1) * ita(j) * ((-1) + 1) * (ita(j) - 1);
            1/2 * (-1) * ((-1) - 1) * (1 - ita(j)^2);
            (1 - (-1)^2) * (1 - ita(j)^2);
            1/2 * (-1) * ((-1) + 1) * (1 - ita(j)^2);
            1/4 * (-1) * ita(j) * ((-1) - 1) * (ita(j) + 1);
            1/2 * ita(j) * (1 - (-1)^2) * (ita(j) + 1);
            1/4 * (-1) * ita(j) * ((-1) + 1) * (ita(j) + 1);];
        Fyp = [1/4 * (1 - (-1)) * (1 - ita(j))
            1/4 * (1 + (-1)) * (1 - ita(j))
            1/4 * (1 + (-1)) * (1 + ita(j))
            1/4 * (1 - (-1)) * (1 + ita(j))];
        P = [p_value1, 0, 0, P_value2]';
        le = sqrt((JXYe(7 ,1) - JXYe(1 ,1))^2 + (JXYe(7 ,2) - JXYe(1 ,2))^2);
        Fe1 = Fe1 + gw(j) * Fyp' * P * l * fy *le/2;
        Fe2 = Fe2 + gw(j) * Fyp' * P * m * fy *le/2;
    end
end
%%%%%%% 当压力施加于单元第4边时，Fe1和Fe2的计算
%%%%%%% Fe1, Fe2的数值积分