function JM4 = JMV_9to4(JM9)
k = 0;
%%%%%%% 二次九结点单元拆分为四个线性单元
for i = 1:length(JM9(:, 1))   % 遍历所有二次九结点速度单元
    %%%%%%% 单元结点1254
    k = k + 1;
    JM4(k, :) = [JM9(i, 1), JM9(i, 2), JM9(i, 5), JM9(i, 4)];
    %%%%%%% 单元结点1254

    %%%%%%% 单元结点2365
    k = k + 1;
    JM4(k, :) = [JM9(i, 2), JM9(i, 3), JM9(i, 6), JM9(i, 5)];
    %%%%%%% 单元结点2365

    %%%%%%% 单元结点4587
    k = k + 1;
    JM4(k, :) = [JM9(i, 4), JM9(i, 5), JM9(i, 8), JM9(i, 7)];
    %%%%%%% 单元结点4587

    %%%%%%% 单元结点5698
    k = k + 1;
    JM4(k, :) = [JM9(i, 5), JM9(i, 6), JM9(i, 9), JM9(i, 8)];
    %%%%%%% 单元结点5698

end
%%%%%%% 二次九结点单元拆分为四个线性单元